Repository: 84000/data-translation-memory
Catalog: toh67-v3.tmx
Source language: bo
Languages: en

source: འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་དེའི་ཚེ་སེ་གོལ་གྱི་སྒྲ་མཛད་དེ། སེ་གོལ་གྱི་སྒྲ་དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་མངོན་པར་གྲགས་པར་གྱུར་ཏོ།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers snapped his fingers, and that finger snap resounded in the buddha fields in the ten directions, as many as the grains of sand in the Ganges.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་དུ་སེ་གོལ་གྱི་སྒྲས་མངོན་པར་གྲགས་པར་གྱུར་པ་དེ་སྙེད་ཁོ་ན་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་པར་ཡང་གྱུར་ཏོ། །ཇི་སྙེད་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་པར་གྱུར་པ་དེ་སྙེད་ཁོ་ན་སྣང་བ་ཆེན་པོས་ཡོངས་སུ་ཁྱབ་པར་ཡང་གྱུར་ཏོ།
en: All the buddha fields in which that finger snap resounded shook in six ways, and, shaking in six ways, they were pervaded by a great light. “

source: །འོད་སྲུང་དེ་ནས་ཁྱེའུ་དེ་གཉིས་ཀྱིས་སྒྲ་དེ་ཐོས་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ཀྱི་དྲུང་ནས་ལངས་པར་གྱུར་ཏེ།
en: When the two youths heard that sound, Kāśyapa, they were lifted up in the presence of the Tathāgata.

source: འོད་སྲུང་ཁྱེའུ་དེ་གཉིས་ལངས་པར་གྱུར་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ལྷ་དང་མིའི་སིལ་སྙན་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་མ་གསིལ་མ་དཀྲོལ་བར་རོལ་མོའི་སྒྲ་དག་འབྱིན་པར་གྱུར་ཅིང་མེ་ཏོག་གི་ཆར་དག་ཀྱང་མངོན་པར་རབ་ཏུ་བབ་པར་གྱུར་ཏོ།
en: Kāśyapa, as the two youths were lifted up, in the great billionfold universe every kind of human and divine musical instrument sounded without being struck or played, while a rain of flowers descended. “

source: །འོད་སྲུང་དེ་ནས་ཁྱེའུ་དེ་གཉིས་ལངས་ནས་ཀྱང་ཡང་དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་ལ་བསྐོར་བ་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ་དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་དུ་ལྟ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Kāśyapa, after they were lifted, the two youths once more bowed at the feet of the Tathāgata, circumambulated him, and, with their palms joined, sat down to one side, gazing at him.

source: །རིགས་ཀྱི་བུ་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ངའི་ཞབས་ཀྱི་དྲུང་དུ་གཏུགས་ནས་ང་ལ་ཡིད་ཀྱིས་ཞུ་བ་འདི་སྐད་ཅེས་ཡོངས་སུ་ཞུས་ཏེ། བཅོམ་ལྡན་འདས་རྒྱལ་པོ་མུ་ཁྱུད་འདིས་སྦྱིན་པ་བྱ་བའི་ཆོས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་གང་ལགས་པ་དང་། དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། ཡོངས་སུ་གཏོང་བ་གང་ལགས་པ་དེ་ཟིལ་གྱིས་གནོན་ཅིང་ཡོངས་སུ་གཏུགས་ཏེ་གནས་པར་འགྱུར་བའི་སྦྱིན་པ་མཆིས་ལགས་སམ། ཡོངས་སུ་གཏོང་བ་མཆིས་ལགས་སམ།
en: Then the Tathāgata Myriad Flowers summoned the bodhisattva Sumati and said to him, ‘Son of noble family, when these two youths touched my feet, they asked me this question that they had in mind, “Blessed One, is there any gift, renunciation, or root of virtue that surpasses or reaches the end of the generosity of King Nimi in giving whatever should be given, in his roots of virtue, and in his renunciation?”

source: དགེ་བའི་རྩ་བ་མཆིས་ལགས་སམ་ཞེས་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ང་ལ་ཞུ་བ་དེ་སྐད་ཡོངས་སུ་ཞུས་ནས་དེ་བཞིན་གཤེགས་པའི་ཞབས་གཉིས་ལ་གཏུགས་སོ། །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་།
en: After they asked me this question, the two youths touched the feet of the Tathāgata.’ “

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ཞུས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Kāśyapa, then the bodhisattva Sumati made a request to the Tathāgata Myriad Flowers, ‘Blessed One, for the benefit of many beings, for the happiness of many beings, out of love for the world, and for the welfare, benefit, and happiness of the great mass of beings, gods and humans, please expound on the question that the two youths have asked.’ “

source: འོད་སྲུང་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བཟང་པོ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཉོན་ཅིག་དང་། བཤད་པར་བྱའོ།
en: Kāśyapa, in reply to the bodhisattva great being Sumati, the Tathāgata Myriad Flowers said, ‘Well, then, son of noble family, listen and I shall expound it.

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོ་མུ་ཁྱུད་འདིས་བསོད་ནམས་ཀྱི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་བས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དབེན་པར་གནས་པ་ཞིག་དགོན་པ་དང་། རབ་ཏུ་དགོན་པ་དག་ལ་གནས་ཤིང་སེ་གོལ་གཏོགས་པ་ཙམ་ཞིག་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པའོ་ཞེས་བཟོད་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་ཆེ་བར་རིག་པར་བྱའོ།
en: Son of noble family, you should understand that, compared to the meritorious generosity of King Nimi, any bodhisattva who lives in solitude, dwelling in forests and wildernesses, who merely for the duration of a finger snap attains acceptance of the unborn nature of all phenomena, amasses far greater merit.

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོ་མུ་ཁྱུད་འདིའི་སྦྱིན་པ་ལྟ་ཞོག་གི །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་ཙམ་པ་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེས་ཀྱང་སོ་སོ་ནས་རྒྱལ་པོ་མུ་ཁྱུད་འདིའི་སྦྱིན་པ་ཇི་སྙེད་པ་དེ་སྙེད་ཅིག་བྱིན་པར་གྱུར་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་བསོད་ནམས་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབེན་པར་གནས་པ་ཡང་དག་པའི་བསམ་པ་དང་ལྡན་པ་དང་། ཡང་དག་པའི་ལམ་དུ་ཞུགས་པ།
en: Son of noble family, never mind the generosity of King Nimi—suppose each and every individual being, as many as all the beings in the great billionfold universe, gave as much as was given by King Nimi.

source: ཚུལ་བཞིན་ལ་རབ་ཏུ་བརྩོན་པ་ཞིག་ཆོས་ཐམས་ཅད་སྟོང་པ་དང་། འོང་བ་མེད་པ་དང་། འགྲོ་བ་མེད་པ་ཞེས་བྱ་བར་སེ་གོལ་གཏོགས་པ་ཙམ་ཞིག་བཟོད་ཅིང་གནས་པར་གྱུར་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་ནི་སེ་གོལ་གཏོགས་པ་ཙམ་ཞིག་བཟོད་པ་ལ་གནས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་།
en: Take whatever merit was amassed by all those beings contained in the great billionfold universe—if a bodhisattva who lives in solitude, has the correct intention, has entered the correct path, and exerts themselves properly remains, merely for the duration of a finger snap, in the acceptance that all phenomena are empty and without coming or going, the merit amassed by all the aforementioned beings would not come close to even a hundredth part of the merit amassed by remaining in that acceptance merely for the duration of a finger snap.

source: བྱེ་བའི་ཆ་དང་། བྱེ་བ་ཕྲག་བརྒྱའི་ཆ་དང་། བྱེ་བ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཕྲག་འབུམ་གྱི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱི་བར་གྱི་ཆ་དང་།
en: It would not come close to even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, or a trillionth, up to a hundred billion trillionth part of it.

source: གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། ཉེ་བར་འཇལ་བ་དང་།
en: It would not come close to any number, fraction, quantity, analogy, or simile, up to any comparison. “ ‘

source: རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ། །རིགས་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལྟ་ཡང་ཞོག་གི །འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སེམས་ཅན་ཇི་སྙེད་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེས་ཀྱང་སྐད་ཅིག་དང་། ཐང་ཅིག་དང་། ཡུད་ཙམ་ཅིག་ལ་རྒྱལ་པོ་མུ་ཁྱུད་འདིས་སྦྱིན་པ་བྱིན་པ་དང་།
en: Son of noble family, never mind the merit amassed by all the beings contained in the great billionfold universe—suppose each and every individual being, as many as all the beings in as many universes as the grains of sand in the Ganges, for one instant, one minute, or one moment gave as much as King Nimi has given and created as much virtue as he has created, and each of those beings gave that much and created that much virtue merely for the duration of a single finger snap.

source: དགེ་བ་མངོན་པར་འདུས་བྱས་པ་ཇི་སྙེད་པ་དེ་སྙེད་ཅིག་བྱས་ཤིང་སེམས་ཅན་དེ་དག་རེ་རེས་སེ་གོལ་གཏོགས་པ་ཙམ་གཅིག་ལ་ཡང་དེ་སྙེད་ཀྱི་སྦྱིན་པ་བྱིན་ཞིང་དགེ་བ་མངོན་པར་འདུས་བྱས་པར་གྱུར་ལ། རྣམ་གྲངས་དེ་ལྟ་བུས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སྦྱིན་པ་བྱིན་ཞིང་དགེ་བ་མངོན་པར་འདུས་བྱས་པར་གྱུར་ན།
en: Suppose all those beings then gave as much and created as much virtue as that for as many eons as the grains of sand in the Ganges. “ ‘

source: རིགས་ཀྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Son of noble family, what do you think?

source: དགེ་བའི་རྩ་བ་དེ་དག་མང་བ་ཡིན་སྙམ་འམ།
en: Would those roots of virtue be many?’ “

source: འོད་སྲུང་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་དཔེ་དེ་ལྟ་བུ་མཛད་པ་ནི་ངོ་མཚར་ལགས་ཏེ།
en: Kāśyapa, when the Tathāgata Myriad Flowers said this, the bodhisattva Sumati replied, ‘Blessed One, such an analogy given by the Tathāgata is amazing.

source: དགེ་བའི་རྩ་བ་དེ་ནི་བསམ་པར་ཡང་སླ་བ་མ་ལགས་པས་བསམ་གྱིས་མི་ཁྱབ་པ་ལགས་སོ། །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་མོས་པར་བྱ། ཁྱོད་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: Those roots of virtue are not easy to conceive, and they are therefore inconceivable.’ “

source: མཁས་པ་མངོན་པར་སྦྱང་བ་བྱས་པ། ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པ་གང་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ནི་འདི་ལ་མོས་པར་འགྱུར་ཏེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡུན་རིང་པོ་དེ་སྲིད་དུ་མངོན་པར་འདུས་བྱས་པ་དེ་ཙམ་དུ་དཔག་ཏུ་མེད་ཅིང་དེ་ཙམ་དུ་བསམ་གྱིས་མི་ཁྱབ་པ་གང་ཡིན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བ་སྔ་མ་དེ་ནི་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ལྷག་པའི་བསམ་པ་གང་གིས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་གཏུགས་ཤིང་ཕྱག་འཚལ་བ་འདིའི་བརྒྱའི་ཆར་ཡང་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers said to the bodhisattva Sumati, ‘Son of noble family, believe this and take it to heart: the wise and learned of the future who have acceptance of the profound will believe this—the aforementioned roots of virtue of all those beings, created over such a long time and so incalculable and inconceivable, would not approach even a hundredth part of the noble intention with which these two youths prostrated to and touched the feet of the Tathāgata.

source: བྱེ་བའི་ཆ་དང་། བྱེ་བ་ཕྲག་བརྒྱའི་ཆ་དང་། བྱེ་བ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཕྲག་འབུམ་གྱི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱི་བར་གྱི་ཆ་དང་། གྲངས་དང་།
en: They would not come close to even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, or a trillionth, up to a hundred billion trillionth part of it.

source: ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། ཉེ་བར་འཇལ་བ་དང་། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: It would not come close to any number, fraction, quantity, analogy, or simile, up to any comparison.’ “

source: །འོད་སྲུང་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་དགེ་སློང་གི་དགེ་འདུན་ལས་དགེ་སློང་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བསྟན་པ་འདི་ཐོས་ནས་ཚིག་འཐུན་པར་རྗེས་སུ་ཡི་རང་བའི་ཚིག་འདི་སྐད་ཅེས་བརྗོད་དེ། བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་སེམས་ཅན་གང་དག་ཆོས་ཟབ་མོ་རྣམས་ལ་བཟོད་པར་འགྱུར་བ་དང་། གང་དག་ཆོས་ཐམས་ཅད་སྟོང་པར་མོས་པར་བགྱིད་པ་དང་། གང་དག་དབེན་པ་ལ་དགའ་ཞིང་དགོན་པ་ལ་མངོན་པར་ཕྱོགས་ཏེ་གོམ་པ་བདུན་འདོར་བར་བགྱིད་པ་དང་། གང་དག་ཡེ་ཤེས་དེ་ལྟ་བུ་ཡོངས་སུ་བསྒྲུབ་པར་བགྱི་བའི་སླད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིད་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་རྗེས་སུ་ཡི་རང་བའི་ཚིག་བརྗོད་པར་གྱུར་ཏོ།
en: Then, Kāśyapa, from the saṅgha of monks of the Tathāgata Myriad Flowers, eighty-four thousand of them, after hearing this teaching, spoke these words of joyful accord: ‘Blessed One, we rejoice in the roots of virtue of those beings who develop acceptance of the profound teachings, who believe that all phenomena are empty, who delight in solitude and take seven steps in the direction of the forest, and who, in order to achieve such wisdom, generate the thought of unsurpassed, perfect awakening.’

source: །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་དགེ་སློང་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་ལྷག་པའི་བསམ་པ་དེ་ལྟ་བུས་རྗེས་སུ་ཡི་རང་བའི་ཚིག་དེ་ལྟ་བུ་བརྗོད་པ་ནི་ལེགས་སོ་ལེགས་སོ།
en: Thus they expressed their joy. “Then, Kāśyapa, the Tathāgata Myriad Flowers commended those monks, saying, ‘Sons of noble family, well done for expressing such joy on account of such a noble intention.

source: །གལ་ཏེ་ཁྱེད་ཅག་གི་སེམས་དག་རྣམ་པར་གྲོལ་བར་མ་གྱུར་དུ་ཟིན་ན་ནི་ཁྱེད་ཅག་དགེ་བའི་རྩ་བ་དེས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བཅུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་ཀྱིས་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: If your minds have not yet been liberated, by this root of virtue you will be installed as universal monarchs in as many kingdoms as the grains of sand in the Ganges, and you will then attain unsurpassed and perfect awakening.’

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་སེམས་ཅན་དེ་དག་གིས་སེམས་བསྐྱེད་པ་དེ་དག་དང་། གང་དག་ལ་ཆོས་ཐམས་ཅད་སྟོང་པ་དང་། དབེན་པ་དང་། ཉེ་བར་ཞི་བ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། རང་བཞིན་མ་མཆིས་པར་གློ་བ་ཆེས་པ་མཆིས་པ་དང་། བཟོད་པ་མཆིས་པ་དང་། མོས་པ་མཆིས་པ་དེ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་ལགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: ” Then the elder Mahākāśyapa and everyone in the assembly declared with one accord, “Blessed One, we rejoice in those beings whose minds are set on awakening and who trust, accept, and believe that all phenomena are empty, isolated, at peace, free from attachment, and without a self-nature.”

source: འོད་སྲུང་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ལ་ཁྱེའུ་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་སྦྱིན་པ་ལ་དགའ་བར་ཡང་མི་བགྱིད་ལ་སེར་སྣ་ཅན་དུ་ཡང་མི་འགྱུར་བ་དང་། ཀུན་འཛིན་པའི་སེམས་མ་མཆིས་པ་དང་། གཞན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྩོལ་བར་བགྱིད་པ་དེ་དག་མཐོང་ན་ཡང་དེ་ལ་དགའ་བ་སྐྱེད་པར་མི་བགྱིད་པ་དང་། གོང་དུ་ཡང་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་བླ་ན་མེད་པས་གནས་པ་འཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་ཡང་བགྱིད་ལགས། འོད་སྲུང་དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: The Blessed One again said to the elder Mahākāśyapa, “Then, Kāśyapa, the two youths Dharma and Sudharma asked the Tathāgata Myriad Flowers, ‘Blessed One, how many qualities does a bodhisattva possess if they take no pleasure in gifts and are neither avaricious nor acquisitive, if it does not please them when they sees others bestowing worldly trifles, and if they have, in addition, attained the state that is the unsurpassed state of a buddha, gained acceptance of the profound, and perfected unsurpassed wisdom?’ “

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཁྱེའུ་ཆོས་དང་། ཆོས་བཟང་གཉིས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྦྱིན་པ་ལ་དགའ་བར་ཡང་མི་བྱེད་ལ་སེར་སྣ་ཅན་དུ་ཡང་མི་འགྱུར་བ་དང་། ཀུན་འཛིན་པའི་སེམས་མེད་པ་དང་། གཞན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པར་བྱེད་པ་དེ་མཐོང་ན་ཡང་དེ་ལ་དགའ་བ་སྐྱེད་པར་མི་བྱེད་པ་དང་། གོང་དུ་ཡང་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་བླ་ན་མེད་པས་གནས་པ་འཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་།
en: Kāśyapa, the Tathāgata Myriad Flowers replied to the two youths, Dharma and Sudharma, ‘Sons of noble family, if a bodhisattva possesses four qualities, they take no pleasure in gifts and are neither avaricious nor acquisitive, it does not please them when they see others bestowing worldly trifles, and they have, in addition, attained the state that is the unsurpassed state of a buddha, gained acceptance of the profound, and perfected unsurpassed wisdom.

source: བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། བཞི་གང་ཞེ་ན།
en: What are the four?

source: སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། དབེན་པར་གནས་པ་དང་། ཟབ་མོ་ལ་བཟོད་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་སྟེ།
en: They are belief in emptiness, dwelling in solitude, acceptance of the profound, and proper thinking.

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་སྦྱིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་ལ་སེར་སྣ་ཅན་དུ་ཡང་མི་འགྱུར་བ་དང་། ཀུན་འཛིན་པའི་སེམས་མེད་པ་དང་། གཞན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པར་བྱེད་པ་དེ་མཐོང་ན་ཡང་དེ་ལ་དགའ་བ་སྐྱེད་པར་མི་བྱེད་པ་དང་། གོང་དུ་ཡང་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་བླ་ན་མེད་པས་གནས་པ་འཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: Sons of noble family, if a bodhisattva possesses those four qualities, they take no pleasure in gifts and are neither avaricious nor acquisitive, it does not please them when they see others bestowing worldly trifles, and they have, in addition, attained the state that is the unsurpassed state of a buddha, gained acceptance of the profound, and perfected unsurpassed wisdom. “ ‘

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྦྱིན་པ་ལ་དགའ་བར་ཡང་མི་བྱེད་ལ་སེར་སྣ་ཅན་དུ་ཡང་མི་འགྱུར་བ་དང་། ཀུན་འཛིན་པའི་སེམས་མེད་པ་དང་། གཞན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པར་བྱེད་པ་དེ་མཐོང་ན་ཡང་དེ་ལ་དགའ་བ་སྐྱེད་པར་མི་བྱེད་པ་དང་། གོང་དུ་ཡང་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་བླ་ན་མེད་པས་གནས་པ་འཐོབ་པར་འགྱུར་བ་དང་། ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: Sons of noble family, if a bodhisattva further possesses four qualities, they take no pleasure in gifts and are neither avaricious nor acquisitive, it does not please them when they see others bestowing worldly trifles, and they have, in addition, attained the state that is the unsurpassed state of a buddha, gained acceptance of the profound, and perfected unsurpassed wisdom.

source: རིགས་ཀྱི་བུ་དག་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་མང་དུ་ཐོས་པ་ཡོངས་སུ་ཚོལ་བར་བྱེད་པ་དང་། དེ་མང་དུ་ཐོས་པར་གྱུར་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དང་།
en: Sons of noble family, (1) a bodhisattva seeks great learning, and once they are greatly learned, they go into the hamlets, towns, villages, royal palaces, and surrounding regions, where they give the gift of the Dharma. (

source: ཡུལ་འཁོར་དག་ཏུ་ཞུགས་ཏེ། ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་དང་། གང་ལས་ཀྱང་ཐ་ན་ལེགས་སོ། །ཞེས་བྱ་བ་ཙམ་དུ་ཅུང་ཟད་ཀྱང་རེ་བ་མེད་ཅིང་། དེ་གོས་པ་མེད་པའི་སེམས་ཀྱིས་གཞན་དག་ལ་ཆོས་སྟོན་པར་བྱེད་པ་དང་།
en: 2) Without the slightest hope of being commended by anyone, and with an untainted intention, they teach the Dharma to others. (

source: དེ་གོས་པ་མེད་པའི་སེམས་དང་ལྡན་པས་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་སྦྱིན་པའི་སྦྱིན་པ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བསྔགས་ཤིང་བསྟོད་པ་ཡིན་པས་ན་མཆོག་ཡིན་ནོ་ཞེས་དགའ་བ་ཉམས་སུ་མྱོང་བར་བྱེད་པ་སྟེ།
en: 3) With this untainted intention, they feel joy—the blessed buddhas have praised and extolled this gift of the Dharma, therefore it is supreme. (

source: དེ་དག་ནི་སྦྱིན་པ་དམ་པ་སྦྱིན་པ་གཙོ་བོ་འདི་ལ་གནས་པ་ཡིན་ནོ་ཞེས་ཡང་དག་པར་མཐོང་བ་ན་དགའ་བ་ཉམས་སུ་མྱོང་བར་བྱེད་ཅིང་སེམས་ཅན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ཡོངས་སུ་གཏོང་བ་ལ་མངོན་པར་བརྩོན་པ་གཞན་དག་ལ་ནི་དགའ་བར་མི་བྱེད་དོ།
en: 4) Seeing that they adhere to this best and foremost gift-giving, they feel joy, while not being pleased by others who exert themselves in giving worldly trifles to beings. “ ‘

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད། གྲངས་མེད། དཔག་ཏུ་མེད་པ་དག་ན་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཇི་སྙེད་ཅིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་དག་ཐམས་ཅད་ལ་ཚེའི་མཐའ་ཇི་སྲིད་པར་མ་ཚང་བ་མེད་པའི་སྦྱིན་པ་ཕུལ་བར་གྱུར་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ཚུལ་ཁྲིམས་དང་ལྡན་པ། དགེ་བའི་ཆོས་དང་ལྡན་པ་གཞན་ཞིག་གིས་སྙིང་རྗེ་ཆེན་པོ་ཀུན་ཏུ་བསྐྱེད་དེ།
en: Sons of noble family, compare a bodhisattva who presents plentiful offerings for as long as they live to all the tathāgatas, surrounded by their saṅghas of monks, who presently dwell and flourish in the immeasurable, countless, incalculable universes of the ten directions, with another bodhisattva who is endowed with the perfect noble intention, with moral discipline, and with virtuous qualities and who has developed great compassion.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྗེས་སུ་དྲན་པར་བྱེད་པ་ན་གོས་པ་མེད་པའི་སེམས་ཀྱིས་རྙེད་པ་དང་། བཀུར་སྟི་དང་། གྲགས་པ་མི་འདོད་པར་སེམས་ཅན་གཅིག་ཅིག་ལ་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་ཞིག་སྒྲོགས་པར་བྱེད་ཅིང་དེས་ཚིགས་སུ་བཅད་པ་དེ་བཤད་ནས་ཀྱང་ཡི་གེ་མཉམ་པ་ཉིད་ཀྱིས་འདི་ལྟ་སྟེ།
en: They practice recollection of the Buddha, the Blessed One, and recite, with an untainted intention and with no desire for gain, reverence, or renown, a single four-lined verse of Dharma to a single being.

source: དཔེར་ན་ཡི་གེ་འདི་དག་རང་བཞིན་གྱིས་སྟོང་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ་ཡིན་ནོ་ཞེས་རབ་ཏུ་རྟོགས་པར་བྱེད་ན།
en: They also, once the verse is explained, cause them to realize that the sameness of letters means that just as these letters are empty by nature, so too are all phenomena empty by nature.

source: རིགས་ཀྱི་བུ་དག་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་།
en: Sons of noble family, the amount of merit of the former bodhisattva would not come close to even a hundredth part of the amount of this bodhisattva’s merit.

source: རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོ་བའི་ཕྱིར་རོ།
en: That is the reason.’ “

source: །འོད་སྲུང་དེ་ནས་ཡང་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཁྱེའུ་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་རྒྱ་ཆེན་པོས་གནས་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers said to the two youths, ‘Sons of noble family, if a bodhisattva possesses four qualities, they will attain the state that is the vast state of a buddha.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the four?

source: རྒྱ་ཆེན་པོ་ལ་འཇུག་པ་དང་། ཆོས་རྒྱ་ཆེན་པོ་འཆད་པ་དང་། སྦྱིན་པ་རྒྱ་ཆེན་པོ་ཡོངས་སུ་གཏོང་བ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པ་སྟེ།
en: They are to enter into the vast, to expound the vast Dharma, to give vast gifts, and to be intent on the vast.

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་གནས་པ་རྒྱ་ཆེན་པོས་གནས་པ་འཐོབ་པར་འགྱུར་རོ།
en: Sons of noble family, if a bodhisattva possesses those four qualities, they will attain the state that is the vast state of a buddha.’ “

source: །འོད་སྲུང་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཁྱེའུ་དེ་གཉིས་ལ་དེ་ལྟ་དེ་ལྟར་ཆོས་བསྟན་པས་ཁྱེའུ་དེ་གཉིས་ཆོས་ཀྱི་མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མངོན་པར་འཕགས་ཏེ།
en: Kāśyapa, thus the Tathāgata Myriad Flowers taught the Dharma in that way to the two youths, and the two youths’ supreme joy in the Dharma elevated them to the height of seven palm trees.

source: དེ་གཉིས་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཉི་གས་ཚིག་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཐུབ་པ་སྤྱོད་པ་ཐམས་ཅད་མཁྱེན། །སྤྱོད་པ་ཀུན་ལ་མཁས་པ་ལགས།
en: When they had been placed in midair, the pair spoke these verses to the Tathāgata with one accord: “ ‘O sage, you understand all conduct, And you are skilled in all conduct.

source: །སེམས་ཅན་རྣམས་ལ་གཏོང་བ་དང་། །དེ་བཞིན་གཏོང་ལ་མི་གནས་སྟོན།
en: You teach beings giving, And also to not abide in giving. “ ‘

source: །འདི་ལ་བདག་དང་སེམས་ཅན་དང་། །སྲོག་དང་གང་ཟག་མ་མཆིས་པར། །བཟོད་པ་བླ་མེད་གང་ལགས་པ། །སྦྱིན་པ་དེ་ནི་སྦྱིན་ཆེན་ལགས།
en: In this, the gift of unsurpassed acceptance Of the nonexistence of self, being, Life force, or person Is a great gift indeed. “ ‘ “

source: །བཟོད་པ་ཟབ་མོ་བསྒོམ་བྱོས་ལ། །དེ་ལ་འང་རྟོག་པ་མ་བྱེད་ཅེས། །བགྱི་བ་འདི་འདྲ་བཀའ་སྩལ་པ།
en: Cultivate profound acceptance In which you engage in no thought whatsoever”— Thus you proclaim.

source: །དཔའ་ཆེན་ཁྱོད་ནི་ངོ་མཚར་ལགས།
en: Great hero, you are a marvel! “ ‘

source: །གང་ལ་ཆགས་ལ་སོགས་མེད་པ། །བྱང་ཆུབ་དམ་པ་དོན་དུ་གཉེར།
en: Free of attachment and so on, Strive for supreme awakening.

source: །ཡེ་ཤེས་ཆེན་པོ་སྦྱང་བྱས་ནས། །དེ་ལའང་རློམ་སེམས་མ་བྱེད་ཅིག །
en: Having trained in great wisdom, Do not be conceited about that! “ ‘ “

source: རྣམ་གྲོལ་སྟོང་པ་བསྒོམ་པར་གྱིས། །དེ་ལའང་རྣམ་རྟོག་མ་བྱེད་ཅིག །དགོན་པའི་གནས་ནི་རྟེན་བྱེད་པ།
en: Cultivate empty liberation In which you engage in no thought whatsoever.

source: །དབེན་པའི་གནས་ཞེས་གསུངས་པ་མཛད།
en: Resort to forest dwellings; Know dwelling in solitude”—so you teach. “ ‘

source: །རློམ་སེམས་ཡོངས་སུ་སྤངས་པ་ཡི། །སྦྱིན་པ་རྟག་ཏུ་སྦྱིན་པར་བྱ།
en: Always give the gift Of totally abandoning conceit.

source: །གང་ལ་འདུ་ཤེས་མི་འཇུག་པ། །དེ་ནི་རྡུལ་བྲལ་མཐའ་ཡིན་ནོ།
en: Not entertaining concepts— That is the ultimate, dust-free state. “ ‘

source: །ཞི་བའི་གནས་ལས་མི་གཡོ་བའི། །ཚུལ་ཁྲིམས་ཡོངས་སུ་སྦྱང་བར་བྱ།
en: Train in the moral discipline That never wavers from the state of calm.
